// components/Benefits.tsx

import React from 'react';

const MoreInfo: React.FC = () => {
  return (
    <div className="py-5 text-[#64748B]">
      <h2 className="text-2xl font-[vazirBold] mb-4">مزایای خرید قسطی از دیجی‌شهر</h2>
      <p className="mb-4">خرید قسطی کالا یکی از گزینه‌های بسیار مناسب برای کسانی است که در حال حاضر به صورت نقدی نمی‌توانند کالای مورد نیاز خود را خریداری کنند. متقاضیان می‌توانند با دریافت وام آنلاین به راحتی و با کارمزد پایین تر در مقایسه با رقبا خرید اقساطی خود را انجام دهند.</p>

      <h2 className="text-xl font-[vazirBold] mb-4">وام بدون پیش پرداخت</h2>
      <p className="mb-4">وام بدون پیش‌پرداخت از انواع وامی که برای دریافت آن نیاز به وجه نقد ندارید و می‌توانید بدون هیچ سرمایه‌ای آن را دریافت کنید...</p>

      <h2 className="text-xl font-[vazirBold] mb-4">بیشترین سقف دریافت وام کالا</h2>
      <p className="mb-4">سقف دریافت وام کالا در دیجی‌شهر بالاترین سقف وام در بین رقبا است...</p>

      <h2 className="text-xl font-[vazirBold] mb-4">وام با بازپرداخت 60 ماهه</h2>
      <p className="mb-4">وام کالا با بازپرداخت ۶۰ ماهه بهترین شرایظ را برای کسانی که توانایی کم‌تری در پرداخت اقساط دارند...</p>

      <h2 className="text-xl font-[vazirBold] mb-4">وام آنلاین</h2>
      <p className="mb-4">وام آنلاین به راحتی و بدون دردسر در دسترس شماست...</p>

      <h2 className="text-xl font-[vazirBold] mb-4">وام فوری خرید کالا</h2>
      <p className="mb-4">وام فوری کالا، به وامی گفته می‌شود که بانک‌ها و یا سایر ارائه‌کننده‌های وام آن را درکوتاه‌ترین زمان ممکن به مشتریان خود پرداخت می‌کنند...</p>

      <h2 className="text-xl font-[vazirBold] mb-4">وام بدون ضامن</h2>
      <p className="mb-4">یکی از مواردی که در بسیاری از مواقع باعث می‌شود تا افراد در هنگام خرید اقساطی با چالش روبه‌رو شوند...</p>

      <h2 className="text-xl font-[vazirBold] mb-4">اعتبارسنجی بانکی رایگان</h2>
      <p className="mb-4">اعتبارسنجی اقدامی است که طی آن میزان رتبه اعتباری و ریسک اعتباری مشخص می‌شود...</p>

      <h2 className="text-xl font-[vazirBold] mb-4">خرید قسطی با چک</h2>
      <p className="mb-4">خرید با چک برای افرادی که قصد دریافت وام با چک و بدون ضامن را دارند یکی از بهترین گزینه‌ها است...</p>

      <h2 className="text-xl font-[vazirBold] mb-4">چه محصولاتی را می‌توان از دیجی شهر خرید؟</h2>

      <h3 className="text-xl font-semibold mb-2">
        <a href="https://dgshahr.com/plp/category/2723" target="_blank" rel="noopener noreferrer" className="text-blue-500 hover:underline">
          طلا قسطی
        </a>
      </h3>
      <p className="mb-4">خرید قسطی طلا، یک راه عالی برای خرید طلای مورد نظر شما بدون نیاز به پرداخت کل هزینه آن هم به صورت نقدی است...</p>

      <h3 className="text-xl font-semibold mb-2">کالای دیجیتال</h3>
      <p className="mb-4">از مهم‌ترین کالاهایی که می‌توان به صورت خرید قسطی با چک خریداری کرد...</p>

      <h3 className="text-xl font-semibold mb-2">گوشی موبایل</h3>
      <p className="mb-4">این خرید می‌تواند خرید اقساطی گوشی یکی از محصولات پرفروش آن یعنی...</p>

      <h3 className="text-xl font-semibold mb-2">لوازم خانگی</h3>
      <p className="mb-4">از جمله کالاهایی که می‌توانید در زمان خرید در این دسته‌بندی پیدا کنید...</p>

      <h3 className="text-xl font-semibold mb-2">موتور اقساطی</h3>
      <p className="mb-4">تنوع محصولات در دیجی شهر، شامل حال دسته‌بندی موتورسیکلت نیز می‌شود...</p>

      <h4 className="text-lg font-semibold mb-2">مدارک لازم</h4>
      <ul className="list-disc ml-6 mb-4">
        <li>تصویر مجوز فعالیت (برای صاحبان مشاغل آزاد)</li>
        <li>گواهی اشتغال به کار</li>
        <li>چک متقاضی و ضامن (در صورت نیاز)</li>
        <li>تصویر شناسنامه و کارت ملی</li>
        <li>تصاویر مدارک محل اقامت</li>
        <li>تصویر کارت پایان خدمت (برای آقایان)</li>
      </ul>

      <h3 className="text-xl font-[vazirBold] mb-4">مراحل دریافت وام از دیجی شهر</h3>
      <p className="mb-4"><strong>ثبت درخواست</strong>: با مراجعه به وب‌سایت دیجی‌ شهر و کلیک روی گزینه درخواست وام، وارد پنل کاربری می‌شوید.</p>
      <p className="mb-4"><strong>ثبت اطلاعات شخصی</strong>: بعد از ثبت درخواست، اطلاعات شخصی و شغلی خود را وارد می‌کنید.</p>
      <p className="mb-4"><strong>اعتبارسنجی</strong>: در این مرحله باید اعتبارسنجی خود را در پنل دیجی شهر انجام دهید تا رتبه اعتباری شما مشخص شود.</p>
      <p className="mb-4"><strong>تعیین میزان درخواست وام</strong>: در این مرحله با توجه به رتبه اعتباری خود، می‌توانید میزان اعتبار و تعداد ماه‌های بازپرداخت اقساط را انتخاب کنید.</p>
      <p className="mb-4"><strong>تکمیل اطلاعات</strong>: در این مرحله باید مدارک هویتی، سپس مدارک سکونتی و شغلی خود را وارد کنید.</p>
      <p className="mb-4"><strong>انتخاب شعبه بانک شهر</strong>: بعد از بارگذاری مدارک مورد نیاز، شعبه‌ بانک دلخواه‌تان را انتخاب می‌کنید.</p>
      <p className="mb-4"><strong>مراجعه به شعبه</strong>: با مراجعه به شعب بانک شهر، نسبت به تایید و امضای مدارک اقدام کنید.</p>
      <p className="mb-4">*برای متقاضیان تهرانی: متقاضیانی که در تهران زندگی می‌کنند، برای دریافت اعتبار خود نیازی به مراجعه به شعبه ندارند و نماینده دیجی شهر پس از هماهنگی، با رجوع به درب منزل، امضای مدارک را از فرد خواهد گرفت...</p>
      <p className="mb-4"><strong>بررسی مدارک</strong>: پس از بررسی‌ مدارک و اطلاعات‌ وارد شده، پشتیبانی دیجی شهر با شما تماس می‌گیرد و هماهنگی‌های لازم انجام می‌شود.</p>
      <p className="mb-4"><strong>شارژ کیف پول</strong>: پس از تایید بانک، کیف پول‌تان در فروشگاه دیجی شهر شارژ شده و می‌توانید کالای دلخواه خود را به صورت قسطی خریداری کنید.</p>

      <h4 className="text-lg font-[vazirBold] mb-2">سوالات متداول</h4>
      <h4 className="text-xl font-[vazirBold] mb-2">از کجا وام فوری بگیریم؟</h4>
      <p className="mb-4">دیجی شهر شرایطی را فراهم کرده است که با استفاده از آن می‌توانید تا سقف 200 میلیون تومان اعتبار دریافت کرده و تا 60 ماه اقساط پرداخت کنید.</p>

      <h4 className="text-xl font-[vazirBold] mb-2">از کجا وام بدون ضامن بگیریم؟</h4>
      <p className="mb-4">پیدا کردن ضامن، اغلب چالشی است که افراد در پروسه‌ی درخواست وام با آن روبه‌رو می‌شوند...</p>
      </div>
  )}

  export default MoreInfo